system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


application     pimpleFoam;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         10;
deltaT          0.01;

writeControl    timeStep;
writeInterval 100;
startTime      0;


purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;

runTimeModifiable yes;

functions
{
    forces
    {
        type            forces;
        libs            ("libforces.so");      // updated key from deprecated "functionObjectLibs"
        outputControl   timeStep;
        outputInterval  1;

        patches         (sphere);              // patch to integrate forces over

        rho             rhoInf;
        rhoInf          1.0;

        CofR            (0 0 0);               // center of rotation (origin)

        liftDir         (0 0 1);               // ✅ Magnus lift is in Z-direction
        dragDir         (1 0 0);               // freestream is along X
    }
}
