system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-10 -10 -10)
    ( 10 -10 -10)
    ( 10  10 -10)
    (-10  10 -10)
    (-10 -10  10)
    ( 10 -10  10)
    ( 10  10  10)
    (-10  10  10)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 100 100) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    top
    {
        type patch;
        faces
        (
            (2 3 7 6)
        );
    }
    bottom
    {
        type patch;
        faces
        (
            (0 1 5 4)
        );
    }
    side1
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    side2
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    defaultFaces
    {
        type wall;
        faces ();
    }
);

mergePatchPairs ();
