constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| Transport properties                                                      |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}

transportModel  Newtonian;

nu              [0 2 -1 0 0 0 0] 6.667e-05;
