0/U
/*--------------------------------*- C++ -*----------------------------------*\
| Velocity field                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (1 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    top
    {
        type            slip;
    }

    bottom
    {
        type            slip;
    }

    side1
    {
        type            slip;
    }

    side2
    {
        type            slip;
    }

    sphere
    {
        type codedFixedValue;
        value uniform (0 0 0);
        name rotatingBC;

        code
        #{
            const vector omega(0, 1, 0);
            const vector origin(0, 0, 0);

            const vectorField& centres = patch().Cf();  // Correct method

            forAll(centres, faceI)
            {
                operator[](faceI) = omega ^ (centres[faceI] - origin);
            }
        #};
    }




}
