0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0.00375;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.00375;
    }

    outlet
    {
        type            zeroGradient;
    }

    top
    {
        type            slip;
    }

    bottom
    {
        type            slip;
    }

    side1
    {
        type            slip;
    }

    side2
    {
        type            slip;
    }

    sphere
    {
        type            kqRWallFunction;
        value           uniform 0.00375;
    }
}
